CRM_API_working/app/controllers/clients_controller.rb

INSERT INTO "clients" ("NAME", "IDENTITY_CARD", "WEB_PAGE", "ADDRESS", "PHONE", "SECTOR", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    if @client.save

UPDATE "clients" SET "IDENTITY_CARD" = ?, "WEB_PAGE" = ?, "ADDRESS" = ?, "PHONE" = ?, "SECTOR" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["IDENTITY_CARD", "B"], ["WEB_PAGE", "B"], ["ADDRESS", "B"], ["PHONE", "B"], ["SECTOR", "Industria"], ["updated_at", "2018-05-01 21:46:27.898491"], ["id", 2]]
---
  def update
    if @client.update(client_params)

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
  def destroy
    @client.destroy