CRM_API_working/app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("NAME", "LAST_NAME", "EMAIL", "PHONE", "JOB", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["NAME", "p"], ["LAST_NAME", "p"], ["EMAIL", "p"], ["PHONE", "p"], ["JOB", "p"], ["created_at", "2018-05-02 21:46:44.976090"], ["updated_at", "2018-05-02 21:46:44.976090"]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save

UPDATE "contacts" SET "client_id" = ?, "NAME" = ?, "LAST_NAME" = ?, "EMAIL" = ?, "PHONE" = ?, "JOB" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["client_id", 4], ["NAME", "Vargas"], ["LAST_NAME", "Vargas"], ["EMAIL", "Vargas"], ["PHONE", "Vargas"], ["JOB", "Vargas"], ["updated_at", "2018-05-03 00:45:07.027160"], ["id", 1]]
---
  def update
    if @contact.update(contact_params)