CRM_API_working/app/controllers/meetings_controller.rb

INSERT INTO "meetings" ("TITLE", "date", "time", "user_id", "IS_VITUAL", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @meeting = Meeting.new(meeting_params)

    if @meeting.save

UPDATE "meetings" SET "TITLE" = ?, "date" = ?, "time" = ?, "user_id" = ?, "IS_VITUAL" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["TITLE", "prueba123"], ["date", "2018-06-30"], ["time", "16:00"], ["user_id", 24], ["IS_VITUAL", "f"], ["updated_at", "2018-05-03 19:37:47.516391"], ["id", 1]]
---
  def update
    if @meeting.update(meeting_params)

DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 1]]
---
  def destroy
    @meeting.destroy

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_meeting
      @meeting = Meeting.find(params[:id])