CRM_API_working/app/controllers/sessions_controller.rb

  def create
    if    user = User.find_by(USER_NAME: params[:USER_NAME])
---
SELECT  "users".* FROM "users" WHERE "users"."USER_NAME" = ? LIMIT ?  [["USER_NAME", "5"], ["LIMIT", 1]]