CRM_API_working/app/controllers/support_tickets_controller.rb

  def index
    @support_tickets = SupportTicket.all
---
SELECT "support_tickets".* FROM "support_tickets"

  def create
    @support_ticket = SupportTicket.new(support_ticket_params)

    if @support_ticket.save
---
INSERT INTO "support_tickets" ("PROBLEM_TITTLE", "PROBLEM_DETAIL", "client_id", "user_id", "STATUS", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @support_ticket.update(support_ticket_params)
---
UPDATE "support_tickets" SET "PROBLEM_TITTLE" = ?, "PROBLEM_DETAIL" = ?, "STATUS" = ?, "updated_at" = ? WHERE "support_tickets"."id" = ?  [["PROBLEM_TITTLE", "prueba1"], ["PROBLEM_DETAIL", "prueba1"], ["STATUS", "En Proceso"], ["updated_at", "2018-05-03 21:28:44.390684"], ["id", 1]]

  def destroy
    @support_ticket.destroy
---
DELETE FROM "support_tickets" WHERE "support_tickets"."id" = ?  [["id", 2]]

    def set_support_ticket
      @support_ticket = SupportTicket.find(params[:id])
---
SELECT  "support_tickets".* FROM "support_tickets" WHERE "support_tickets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]