CRM_API_working/app/controllers/users_controller.rb

INSERT INTO "users" ("NAME", "LAST_NAME", "USER_NAME", "PASSWORD", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["NAME", "aaa"], ["LAST_NAME", "aaa"], ["USER_NAME", "aa"], ["PASSWORD", "aaa"], ["created_at", "2018-04-14 17:55:35.219073"], ["updated_at", "2018-04-14 17:55:35.219073"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "NAME" = ?, "LAST_NAME" = ?, "USER_NAME" = ?, "PASSWORD" = ?, "PASSWORD_CONFIRMATION" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["NAME", "admin"], ["LAST_NAME", "admin"], ["USER_NAME", "admin"], ["PASSWORD", "123"], ["PASSWORD_CONFIRMATION", "123"], ["admin", "t"], ["updated_at", "2018-04-30 19:34:52.331320"], ["id", 2]]
---
  def update
    #@user = User.update(user_params)
    if @user.update(user_params)